// Типы
export type ChecklistSubitem = {
  id: string;
  question: string;
  answer: string | null;
  comment: string;
};

export type ChecklistItem = {
  id: string;
  question: string;
  subitems: ChecklistSubitem[];
};

export type ChecklistSection = {
  section: string;
  items: ChecklistItem[];
};

// Пример шаблона
export const checklistData = [
  {
    "section": "Обучение персонала, СИЗ, СИЗОД, общие требования",
    "items": [
      {
        "id": "1",
        "question": "Обучение ИТР:",
        "subitems": [
          {
            "id": "1.1",
            "question": "- проверка знаний в АО \"Самаранефтегаз\" (удостоверение)",
            "answer": null,
            "comment": ""
          },
          {
            "id": "1.2",
            "question": "- аттестация по промышленной безопасности (удостоверение или протокол)",
            "answer": null,
            "comment": ""
          },
          {
            "id": "1.3",
            "question": "- проверка знаний требований охраны труда (удостоверение или протокол)",
            "answer": null,
            "comment": ""
          },
          {
            "id": "1.4",
            "question": "- проверка знаний по технологической инструкции Компании \"Требования безопасности...\"",
            "answer": null,
            "comment": ""
          },
          {
            "id": "1.5",
            "question": "- обучение по пожарно-техническому минимуму (удостоверение или протокол)",
            "answer": null,
            "comment": ""
          },
          {
            "id": "1.6",
            "question": "- проверка знаний по курсу \"Контроль скважины. Управление скважиной при ГНВП\"",
            "answer": null,
            "comment": ""
          },
          {
            "id": "1.7",
            "question": "- проверка знаний по охране труда при эксплуатации электроустановок (удостоверение)",
            "answer": null,
            "comment": ""
          }
        ]
      },
      {
        "id": "2",
        "question": "Обучение рабочего персонала:",
        "subitems": [
          {
            "id": "2.1",
            "question": "- проверка знаний в АО \"Самаранефтегаз\" (удостоверение)",
            "answer": null,
            "comment": ""
          },
          {
            "id": "2.2",
            "question": "- удостоверение по основной профессии (совмещаемой при необходимости)",
            "answer": null,
            "comment": ""
          },
          {
            "id": "2.3",
            "question": "- удостоверение по требованиям ОТ по основной профессии",
            "answer": null,
            "comment": ""
          },
          {
            "id": "2.4",
            "question": "- проверка знаний по технологической инструкции Компании",
            "answer": null,
            "comment": ""
          }
        ]
      }
    ]
  },
  // {
  //   "section": "Общая безопасность:",
  //   "items": [
  //     {
  //       "id": "3",
  //       "question": "Пусковая документация:",
  //       "subitems": [
  //         {
  //           "id": "3.1",
  //           "question": "- акт приема-сдачи скважины в ремонт",
  //           "answer": null,
  //           "comment": ""
  //         },
  //         {
  //           "id": "3.2",
  //           "question": "- план работ",
  //           "answer": null,
  //           "comment": ""
  //         },
  //         {
  //           "id": "3.3",
  //           "question": "- акт на глушение скважины",
  //           "answer": null,
  //           "comment": ""
  //         },
  //         {
  //           "id": "3.4",
  //           "question": "- пусковой паспорт",
  //           "answer": null,
  //           "comment": ""
  //         },
  //         {
  //           "id": "3.5",
  //           "question": "- схема расстановки оборудования и опасных зон",
  //           "answer": null,
  //           "comment": ""
  //         }
  //       ]
  //     },
  //     {
  //       "id": "4",
  //       "question": "Ознакомление персонала с планом работ",
  //       "subitems": [
  //         {
  //           "id": "4.1",
  //           "question": "Персонал бригады ознакомлен с планом работ под роспись",
  //           "answer": null,
  //           "comment": ""
  //         }
  //       ]
  //     },
  //     {
  //       "id": "5",
  //       "question": "План мероприятий ПМЛА",
  //       "subitems": [
  //         {
  //           "id": "5.1",
  //           "question": "План мероприятий по локализации и ликвидации аварий с ознакомлением персонала",
  //           "answer": null,
  //           "comment": ""
  //         }
  //       ]
  //     },
  //     {
  //       "id": "6",
  //       "question": "Осмотр оборудования",
  //       "subitems": [
  //         {
  //           "id": "6.1",
  //           "question": "Ежесменный осмотр старшим оператором или бурильщиком бригады и мастером 1 раз в 10 дней",
  //           "answer": null,
  //           "comment": ""
  //         }
  //       ]
  //     }
  //   ]
  // },
  // {
  //   "section": "Пожарная безопасность и инструктажи",
  //   "items": [
  //     {
  //       "id": "7",
  //       "question": "Пожарная сигнализация и аптечка",
  //       "subitems": [
  //         {
  //           "id": "7.1",
  //           "question": "Пожарная сигнализация. Огнетушители, пожарный инвентарь",
  //           "answer": null,
  //           "comment": ""
  //         },
  //         {
  //           "id": "7.2",
  //           "question": "Медицинская аптечка",
  //           "answer": null,
  //           "comment": ""
  //         }
  //       ]
  //     },
  //     {
  //       "id": "8",
  //       "question": "Инструктаж персонала",
  //       "subitems": [
  //         {
  //           "id": "8.1",
  //           "question": "Инструктаж с рабочим персоналом (первичный, повторный, целевой и т.д.)",
  //           "answer": null,
  //           "comment": ""
  //         },
  //         {
  //           "id": "8.2",
  //           "question": "Журнал инструктажей, программы проведения инструктажа",
  //           "answer": null,
  //           "comment": ""
  //         },
  //         {
  //           "id": "8.3",
  //           "question": "Наличие программы инструктажа и регистрации в журнале",
  //           "answer": null,
  //           "comment": ""
  //         }
  //       ]
  //     },
  //     {
  //       "id": "9",
  //       "question": "Средства индивидуальной защиты",
  //       "subitems": [
  //         {
  //           "id": "9.1",
  //           "question": "СИЗ и СИЗОД находятся в наличии и в пригодном состоянии",
  //           "answer": null,
  //           "comment": ""
  //         },
  //         {
  //           "id": "9.2",
  //           "question": "Проверка сроков действия СИЗ",
  //           "answer": null,
  //           "comment": ""
  //         }
  //       ]
  //     }
  //   ]
  // },
  // {
  //   "section": "Техническое состояние оборудования и документация",
  //   "items": [
  //     {
  //       "id": "10",
  //       "question": "Документация на оборудование",
  //       "subitems": [
  //         {
  //           "id": "10.1",
  //           "question": "Паспорт на превентор",
  //           "answer": null,
  //           "comment": ""
  //         },
  //         {
  //           "id": "10.2",
  //           "question": "Акт опрессовки превентора в условиях эксплуатации",
  //           "answer": null,
  //           "comment": ""
  //         },
  //         {
  //           "id": "10.3",
  //           "question": "Акт УЗД превентора",
  //           "answer": null,
  //           "comment": ""
  //         },
  //         {
  //           "id": "10.4",
  //           "question": "Акт на глушение скважины",
  //           "answer": null,
  //           "comment": ""
  //         },
  //         {
  //           "id": "10.5",
  //           "question": "Акт на опрессовку устьевого оборудования",
  //           "answer": null,
  //           "comment": ""
  //         },
  //         {
  //           "id": "10.6",
  //           "question": "Схема монтажа ПВО",
  //           "answer": null,
  //           "comment": ""
  //         },
  //         {
  //           "id": "10.7",
  //           "question": "Журнал учета тех. состояния ПВО",
  //           "answer": null,
  //           "comment": ""
  //         },
  //         {
  //           "id": "10.8",
  //           "question": "Свидетельство о поверке манометров",
  //           "answer": null,
  //           "comment": ""
  //         },
  //         {
  //           "id": "10.9",
  //           "question": "Протокол калибровки предохранительного клапана",
  //           "answer": null,
  //           "comment": ""
  //         },
  //         {
  //           "id": "10.10",
  //           "question": "Фундамент под домкратами",
  //           "answer": null,
  //           "comment": ""
  //         },
  //         {
  //           "id": "10.11",
  //           "question": "Акт УЗД кран-блока",
  //           "answer": null,
  //           "comment": ""
  //         },
  //         {
  //           "id": "10.12",
  //           "question": "Акт УЗД талевого блока",
  //           "answer": null,
  //           "comment": ""
  //         }
  //       ]
  //     }
  //   ]
  // },
  // {
  //   "section": "Оборудование и безопасность в вагоне мастера",
  //   "items": [
  //     {
  //       "id": "11",
  //       "question": "В вагоне мастера",
  //       "subitems": [
  //         {
  //           "id": "11.1",
  //           "question": "Паспорта на противогазы, поверка",
  //           "answer": null,
  //           "comment": ""
  //         },
  //         {
  //           "id": "11.2",
  //           "question": "Медицинская аптечка",
  //           "answer": null,
  //           "comment": ""
  //         },
  //         {
  //           "id": "11.3",
  //           "question": "Газоанализатор (свидетельство о поверке, паспорт)",
  //           "answer": null,
  //           "comment": ""
  //         },
  //         {
  //           "id": "11.4",
  //           "question": "Видеокамера и её работоспособность (архив за 30 дней)",
  //           "answer": null,
  //           "comment": ""
  //         },
  //         {
  //           "id": "11.5",
  //           "question": "Регулировочный светящийся жезл у бригады",
  //           "answer": null,
  //           "comment": ""
  //         },
  //         {
  //           "id": "11.6",
  //           "question": "Светоотражающие жилеты у членов бригады",
  //           "answer": null,
  //           "comment": ""
  //         },
  //         {
  //           "id": "11.7",
  //           "question": "Работы выполняются по плану на КРС (ТРС)",
  //           "answer": null,
  //           "comment": ""
  //         },
  //         {
  //           "id": "11.8",
  //           "question": "Схема информирования о происшествиях ПБОТОС",
  //           "answer": null,
  //           "comment": ""
  //         },
  //         {
  //           "id": "11.9",
  //           "question": "Въезд/выезд обозначен знаком «СТОЙ опасная зона»",
  //           "answer": null,
  //           "comment": ""
  //         },
  //         {
  //           "id": "11.10",
  //           "question": "Пути эвакуации с объекта свободны",
  //           "answer": null,
  //           "comment": ""
  //         },
  //         {
  //           "id": "11.11",
  //           "question": "Аншлаг",
  //           "answer": null,
  //           "comment": ""
  //         },
  //         {
  //           "id": "11.12",
  //           "question": "Повтор схемы информирования о происшествиях ПБОТОС",
  //           "answer": null,
  //           "comment": ""
  //         }
  //       ]
  //     }
  //   ]
  // },
  // {
  //   "section": "Документация и техническое состояние мобильных зданий",
  //   "items": [
  //     {
  //       "id": "13",
  //       "question": "Мобильные здания (вагон-дома) документация",
  //       "subitems": [
  //         {
  //           "id": "13.1",
  //           "question": "Паспорт завода-изготовителя и эксплуатационный паспорт",
  //           "answer": null,
  //           "comment": ""
  //         },
  //         {
  //           "id": "13.2",
  //           "question": "Протоколы измерения сопротивления изоляции",
  //           "answer": null,
  //           "comment": ""
  //         },
  //         {
  //           "id": "13.3",
  //           "question": "Акт приемки автоматической пожарной сигнализации",
  //           "answer": null,
  //           "comment": ""
  //         },
  //         {
  //           "id": "13.4",
  //           "question": "Документы подтверждающие класс пожарной опасности материалов",
  //           "answer": null,
  //           "comment": ""
  //         }
  //       ]
  //     },
  //     {
  //       "id": "14",
  //       "question": "Пожарная безопасность",
  //       "subitems": [
  //         {
  //           "id": "14.1",
  //           "question": "Огнетушители (журнал)",
  //           "answer": null,
  //           "comment": ""
  //         },
  //         {
  //           "id": "14.2",
  //           "question": "Огнетушители (паспорта)",
  //           "answer": null,
  //           "comment": ""
  //         }
  //       ]
  //     }
  //   ]
  // },
  // {
  //   "section": "Противовыбросовое оборудование и подъемный агрегат",
  //   "items": [
  //     {
  //       "id": "15",
  //       "question": "Противопожарные системы в вагон-домах",
  //       "subitems": [
  //         {
  //           "id": "15.1",
  //           "question": "Автоматическая пожарная сигнализация и оповещение",
  //           "answer": null,
  //           "comment": ""
  //         },
  //         {
  //           "id": "15.2",
  //           "question": "Огнетушители (наличие, давление, номер)",
  //           "answer": null,
  //           "comment": ""
  //         },
  //         {
  //           "id": "15.3",
  //           "question": "Огнетушители (мастерская)",
  //           "answer": null,
  //           "comment": ""
  //         },
  //         {
  //           "id": "15.4",
  //           "question": "Огнетушители (спальный вагон)",
  //           "answer": null,
  //           "comment": ""
  //         },
  //         {
  //           "id": "15.5",
  //           "question": "Огнетушители (сушильный вагон)",
  //           "answer": null,
  //           "comment": ""
  //         },
  //         {
  //           "id": "15.6",
  //           "question": "Огнетушители (инструментальный вагон)",
  //           "answer": null,
  //           "comment": ""
  //         },
  //         {
  //           "id": "15.7",
  //           "question": "Огнетушители (столовая)",
  //           "answer": null,
  //           "comment": ""
  //         },
  //         {
  //           "id": "15.8",
  //           "question": "Огнетушители (ПА)",
  //           "answer": null,
  //           "comment": ""
  //         },
  //         {
  //           "id": "15.9",
  //           "question": "Огнетушители (ОП-40)",
  //           "answer": null,
  //           "comment": ""
  //         },
  //         {
  //           "id": "15.10",
  //           "question": "Пожарный инвентарь",
  //           "answer": null,
  //           "comment": ""
  //         },
  //         {
  //           "id": "15.11",
  //           "question": "Противогазы (бирки)",
  //           "answer": null,
  //           "comment": ""
  //         }
  //       ]
  //     }
  //   ]
  // },
  // {
  //   "section": "Подъемный агрегат и вспомогательное оборудование",
  //   "items": [
  //     {
  //       "id": "16.1",
  //       "question": "Подъемный агрегат на устье",
  //       "subitems": [
  //         { "id": "16.1.1", "question": "ПА содержится в чистоте", "answer": null, "comment": "" },
  //         { "id": "16.1.2", "question": "ПА заземлен", "answer": null, "comment": "" },
  //         { "id": "16.1.3", "question": "Фиксатор на рукоятке тормоза лебедки", "answer": null, "comment": "" },
  //         { "id": "16.1.4", "question": "Исправность канатоукладчика", "answer": null, "comment": "" },
  //         { "id": "16.1.5", "question": "Канат соответствует критериям работы", "answer": null, "comment": "" },
  //         { "id": "16.1.6", "question": "Исправность манометров", "answer": null, "comment": "" },
  //         { "id": "16.1.7", "question": "Табличка на мачте с характеристиками", "answer": null, "comment": "" },
  //         { "id": "16.1.8", "question": "Искрогаситель выпускной системы ДВС", "answer": null, "comment": "" },
  //         { "id": "16.1.9", "question": "Смотровые окна кабины с решетками", "answer": null, "comment": "" },
  //         { "id": "16.1.10", "question": "Предохранительный клапан ресивера опломбирован", "answer": null, "comment": "" },
  //         { "id": "16.1.11", "question": "Индикатор веса исправен", "answer": null, "comment": "" },
  //         { "id": "16.1.12", "question": "Противооткаты", "answer": null, "comment": "" },
  //         { "id": "16.1.13", "question": "Фундамент под домкратами (опорная плита)", "answer": null, "comment": "" },
  //         { "id": "16.1.14", "question": "Аварийное глушение двигателя", "answer": null, "comment": "" },
  //         { "id": "16.1.15", "question": "Звуковая сигнализация на пульте управления", "answer": null, "comment": "" }
  //       ]
  //     },
  //     {
  //       "id": "16.2",
  //       "question": "Подъемный агрегат — навесное оборудование",
  //       "subitems": [
  //         { "id": "16.2.1", "question": "Талевый блок", "answer": null, "comment": "" },
  //         { "id": "16.2.2", "question": "Элеваторы", "answer": null, "comment": "" },
  //         { "id": "16.2.3", "question": "Пневматический спайдер (сухари)", "answer": null, "comment": "" },
  //         { "id": "16.2.4", "question": "Пневматический спайдер (обтиратор)", "answer": null, "comment": "" },
  //         { "id": "16.2.5", "question": "Тросы подвески и страховки установлены", "answer": null, "comment": "" },
  //         { "id": "16.2.6", "question": "Блокировка ключа при открытой створке", "answer": null, "comment": "" },
  //         { "id": "16.2.7", "question": "Крепление подвесного каната", "answer": null, "comment": "" },
  //         { "id": "16.2.8", "question": "Ролик для подвешивания ключа", "answer": null, "comment": "" },
  //         { "id": "16.2.9", "question": "Трубные захваты зашплинтованы", "answer": null, "comment": "" }
  //       ]
  //     },
  //     {
  //       "id": "16.3",
  //       "question": "Подъемный агрегат — якоря и оттяжки",
  //       "subitems": [
  //         { "id": "16.3.1", "question": "Светоотражающие элементы на оттяжках", "answer": null, "comment": "" },
  //         { "id": "16.3.2", "question": "Сигнальные обозначения на якорях", "answer": null, "comment": "" },
  //         { "id": "16.3.3", "question": "Крепление оттяжек к якорям — соответствие нормам", "answer": null, "comment": "" },
  //         { "id": "16.3.4", "question": "Оттяжки натянуты без провисов", "answer": null, "comment": "" }
  //       ]
  //     }
  //   ]
  // },
  // {
  //   "section": "Рабочая площадка и приустьевое оборудование",
  //   "items": [
  //     {
  //       "id": "17",
  //       "question": "Рабочая площадка",
  //       "subitems": [
  //         { "id": "17.1", "question": "Соответствие рабочей площадки нормам безопасности", "answer": null, "comment": "" },
  //         { "id": "17.2", "question": "Лестницы на приемные мостки соответствуют нормам", "answer": null, "comment": "" },
  //         { "id": "17.3", "question": "Приставные стеллажи заземлены", "answer": null, "comment": "" },
  //         { "id": "17.4", "question": "Инструмент на стеллажах уложен правильно", "answer": null, "comment": "" },
  //         { "id": "17.5", "question": "Рабочая зона не замазучена и не загромождена", "answer": null, "comment": "" },
  //         { "id": "17.6", "question": "Наличие экологических поддонов", "answer": null, "comment": "" }
  //       ]
  //     }
  //   ]
  // },
  // {
  //   "section": "Блок долива и нагнетательные линии",
  //   "items": [
  //     {
  //       "id": "18",
  //       "question": "Блок долива",
  //       "subitems": [
  //         { "id": "18.1", "question": "Расстояние от блока до скважины выдержано", "answer": null, "comment": "" },
  //         { "id": "18.2", "question": "Объем блока долива не менее 4.5 м3", "answer": null, "comment": "" },
  //         { "id": "18.3", "question": "Удельный вес жидкости соответствует плану", "answer": null, "comment": "" },
  //         { "id": "18.4", "question": "Лестницы и ограждения соответствуют требованиям", "answer": null, "comment": "" },
  //         { "id": "18.5", "question": "Уровнемер исправен", "answer": null, "comment": "" },
  //         { "id": "18.6", "question": "Инспекционный люк с запорным устройством", "answer": null, "comment": "" },
  //         { "id": "18.7", "question": "Нагнетательная линия собрана правильно", "answer": null, "comment": "" },
  //         { "id": "18.8", "question": "Обратный клапан и манометр установлены", "answer": null, "comment": "" },
  //         { "id": "18.9", "question": "Нет утечек на соединениях", "answer": null, "comment": "" },
  //         { "id": "18.10", "question": "Грязевой шланг соответствует нормам", "answer": null, "comment": "" },
  //         { "id": "18.11", "question": "Наличие складных ограждений", "answer": null, "comment": "" }
  //       ]
  //     }
  //   ]
  // },
  // {
  //   "section": "Противовыбросовое оборудование",
  //   "items": [
  //     {
  //       "id": "19",
  //       "question": "ПВО на устье",
  //       "subitems": [
  //         { "id": "19.1", "question": "Соответствие ПВО схеме и документации", "answer": null, "comment": "" },
  //         { "id": "19.1.1", "question": "Условия установки штурвалов и укрытий", "answer": null, "comment": "" },
  //         { "id": "19.2", "question": "ПВО (1 и 2 схема)", "answer": null, "comment": "" },
  //         { "id": "19.2.1", "question": "Согласование и утверждение смонтированного ПВО", "answer": null, "comment": "" }
  //       ]
  //     }
  //   ]
  // },
  // {
  //   "section": "Сигнализация и освещение",
  //   "items": [
  //     {
  //       "id": "20",
  //       "question": "Освещение и связь",
  //       "subitems": [
  //         { "id": "20.1", "question": "Телефонная связь", "answer": null, "comment": "" },
  //         { "id": "20.2", "question": "Звуковая сигнализация на пульте", "answer": null, "comment": "" },
  //         { "id": "20.3", "question": "Освещение во взрывозащитном исполнении", "answer": null, "comment": "" }
  //       ]
  //     }
  //   ]
  // },
  // {
  //   "section": "Электробезопасность и заземление",
  //   "items": [
  //     {
  //       "id": "21",
  //       "question": "Электробезопасность",
  //       "subitems": [
  //         { "id": "21.1", "question": "Заземление ПА", "answer": null, "comment": "" },
  //         { "id": "21.2", "question": "Заземление вагонов", "answer": null, "comment": "" },
  //         { "id": "21.3", "question": "Заземление электростанции", "answer": null, "comment": "" },
  //         { "id": "21.4", "question": "Приемные мостки заземлены", "answer": null, "comment": "" },
  //         { "id": "21.5", "question": "Стеллажи заземлены", "answer": null, "comment": "" },
  //         { "id": "21.6", "question": "Приустьевая площадка заземлена", "answer": null, "comment": "" },
  //         { "id": "21.7", "question": "Емкости раствора заземлены", "answer": null, "comment": "" },
  //         { "id": "21.8", "question": "ГСМ емкости заземлены", "answer": null, "comment": "" },
  //         { "id": "21.9", "question": "Желобная система заземлена", "answer": null, "comment": "" },
  //         { "id": "21.10", "question": "Все остальные металлические конструкции заземлены", "answer": null, "comment": "" },
  //         { "id": "21.11", "question": "Шкафы закрыты", "answer": null, "comment": "" },
  //         { "id": "21.12", "question": "Переносной светильник ≤ 12В", "answer": null, "comment": "" },
  //         { "id": "21.13", "question": "Электрокабель пересекает дороги в трубах", "answer": null, "comment": "" }
  //       ]
  //     }
  //   ]
  // },
  // {
  //   "section": "Мобильные здания (вагон-дома)",
  //   "items": [
  //     {
  //       "id": "22",
  //       "question": "Безопасность и документация",
  //       "subitems": [
  //         { "id": "22.1", "question": "Вагон-дома установлены по схеме", "answer": null, "comment": "" },
  //         { "id": "22.2", "question": "Экологические поддоны", "answer": null, "comment": "" },
  //         { "id": "22.3", "question": "Противооткатные упоры", "answer": null, "comment": "" },
  //         { "id": "22.4", "question": "Амортизирующие опоры", "answer": null, "comment": "" },
  //         { "id": "22.5", "question": "Лестницы и перила соответствуют требованиям", "answer": null, "comment": "" },
  //         { "id": "22.6", "question": "Нет решеток на окнах и дверях", "answer": null, "comment": "" },
  //         { "id": "22.7", "question": "Запорные устройства отсутствуют", "answer": null, "comment": "" },
  //         { "id": "22.8", "question": "Кабели проходят в изоляционных трубах", "answer": null, "comment": "" },
  //         { "id": "22.9", "question": "Независимое заземление", "answer": null, "comment": "" },
  //         { "id": "22.10", "question": "Защита от КЗ и УЗО", "answer": null, "comment": "" },
  //         { "id": "22.11", "question": "Освещение пылевлагозащищённое", "answer": null, "comment": "" },
  //         { "id": "22.12", "question": "Пожарная сигнализация с оповещением", "answer": null, "comment": "" },
  //         { "id": "22.13", "question": "Огнетушители ≥ 4 кг в доступных местах", "answer": null, "comment": "" },
  //         { "id": "22.14", "question": "Нет печей на жидком, твёрдом, газовом топливе", "answer": null, "comment": "" },
  //         { "id": "22.15", "question": "Пути эвакуации свободны", "answer": null, "comment": "" }
  //       ]
  //     }
  //   ]
  // }
];
